In [98]:
import pandas as pd

In [99]:
color = ['Red','Blue','Green']
pd.Series(color)

0      Red
1     Blue
2    Green
dtype: object

In [100]:
n = [1,2,3,4,5]
pd.Series(n)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [101]:
c = {'apple':'Red',
     'mango':'yellow',
     'Orange':'Orange',
     'Grapes':'Green',
     'Papaya':'Green_yellow'}
s = pd.Series(c)
s

apple              Red
mango           yellow
Orange          Orange
Grapes           Green
Papaya    Green_yellow
dtype: object

In [102]:
s.index
s['apple']

'Red'

In [103]:
d = pd.Series(['Red','yellow','Orange','Greeen','Green_yellow'],
             index = ['apple','mango','Orange','Graps','Papaya'])
d

apple              Red
mango           yellow
Orange          Orange
Graps           Greeen
Papaya    Green_yellow
dtype: object

In [104]:
d['apple'],d[0]

('Red', 'Red')

# Data Frame

In [105]:
p1 = pd.Series({'Name':'karan',
              'age':24,
              'Gender':'Male','Address':'Nashik'})
p1

Name        karan
age            24
Gender       Male
Address    Nashik
dtype: object

In [106]:
p2 = pd.Series({'Name':'karn',
              'age':22,
              'Gender':'Male',
                'Address':'Japan'})
p2

Name        karn
age           22
Gender      Male
Address    Japan
dtype: object

In [107]:
p3 = pd.Series({'Name':'Aishawryaa',
              'age':10,
              'Gender':'Male',
                'Address':'Chaina'})
p3

Name       Aishawryaa
age                10
Gender           Male
Address        Chaina
dtype: object

In [108]:
df  =  pd.DataFrame([p1,p2,p3],index = ['person1','person2','person3'])
df

               Name  age Gender Address
person1       karan   24   Male  Nashik
person2        karn   22   Male   Japan
person3  Aishawryaa   10   Male  Chaina

In [109]:
df.loc['person2','Address']

'Japan'

In [110]:
df.loc['person2','Gender']

'Male'

In [111]:
df.loc['person2','Name']

'karn'

In [112]:
import numpy as np

In [113]:
Random_data = np.random.randint(10,200,25).reshape(5,5)
Random_data

array([[186, 105,  13,  14, 153],
       [ 77, 108,  21,  46, 114],
       [119, 161,  40, 133, 166],
       [ 50,  41, 154,  72, 132],
       [ 16, 151,  32, 143, 188]])

In [114]:
list('ABGSHDJS')

['A', 'B', 'G', 'S', 'H', 'D', 'J', 'S']

In [115]:
pd.DataFrame(Random_data,index =['monday','tuesday','wednesday','thirsday','friday'])

             0    1    2    3    4
monday     186  105   13   14  153
tuesday     77  108   21   46  114
wednesday  119  161   40  133  166
thirsday    50   41  154   72  132
friday      16  151   32  143  188

In [116]:
clip = pd.read_clipboard()
clip

Empty DataFrame
Columns: [karan, 24, Male, Nashik]
Index: []

In [117]:
# df['person1'].rename({'Name':'vikas','age':24})

In [118]:
o

             0    1    2    3    4
monday     181  131  163   25   74
tuesday    148   49  139  174  184
wednesday   71  132  190   74   10
thirsday   193  112   46   61   20
friday     161   91  195   88  180